const vorterxFancy = (styleNumber) => {
  const fancyTextStyles = [
    "1 VORTERX MD",
    "2 Vᴏʀᴛᴇʀx",
    "3 𝓥𝓸𝓻𝓽𝓮𝓻𝔁",
    "4 ⓋⓄⓇⓉⓔⓇⓍ",
    "5 🅋🄾🅁🅃🄴🅁🅇",
    "6 𝕍𝕆ℝ𝕋𝔼ℝ𝕏",
    "7 ⒱ⓞⓡⓉⓔⓡⓧ",
    "8 𝐕𝐎𝐑𝐓𝐄𝐑𝐗",
    "9 𝔳𝔬𝔯𝔱𝔢𝔯𝔵",
    "10 🆅🅾🆁🆃🅴🆁🆇",
    "11 𝗩𝗢𝗥𝗧𝗘𝗥𝗫",
    "12 ⓥⓞⓡⓣⓔⓡⓧ",
    "13 ƲOƦƬƐƦƔ",
    "14 🅥🅞🅡🅣🅔🅡🅧",
    "15 𝒱𝑜𝓇𝓉𝑒𝓇𝓍",
    "16 νσятєяx",
    "17 🆅🄾🆁🆃🄴🅁🅇",
    "18 ⅤØ℟₮Ǝ℟✖",
    "19 𝕧𝕠𝕣𝕥𝕖𝕣𝕩",
    "20 🄛🄞🄡🄗🄕🄟🄚",
    "21 🄯🄾🅁🅃🄴🅁🅇",
    "22 𝓿𝓸𝓻𝓽𝓮𝓻𝔁",
    "23 ⒻⒶⓃⒸⓎ ⒯ⓔⓍⓉ",
    "24 𝒱𝑜𝓇𝓉𝑒𝓇𝓍",
    "25 🆅🅞🅡🅣🅔🅡🅧",
    "26 𝓿𝓸𝓻𝓽𝓮𝓻𝔁",
    "27 ᐯOᖇTEᖇ᙭",
    "28 𐑈𐑆𐑉𐑆𐑖𐑒𐑊",
    "29 🅥🅞🅡🅣🅔🅡🅧",
    "30 𝑽𝑶𝑹𝑻𝑬𝑹𝑿",
    "31 🆅🄾🆁🆃🄴🅁🅇",
    "32 ⓋⓄⓇⓉⓔⓇⓍ",
    "33 𝙑𝙊𝙍𝙏𝙀𝙍𝙓",
    "34 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "35 𐐥𐐮𐑌𐐽𐑉𐑅𐑇",
    "36 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "37 ⓥⓞⓡⓣⓔⓡⓧ",
    "38 🄛🄞🄡🄗🄕🄟🄚",
    "39 🄯🄾🅁🅃🄴🅁🅇",
    "40 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "41 ᗯOᖇTᗴᖇ᙭",
    "42 ᐯOᖇTEᖇX",
    "43 𝖛𝖔𝖗𝖙𝖊𝖗𝖝",
    "44 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "45 🅥🅞🅡🅣🅔🅡🅧",
    "46 𝒱𝑜𝓇𝓉𝑒𝓇𝓍",
    "47 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "48 ⅴⓞℝтєяx",
    "49 𝓋𝑜𝓇𝓉𝑒𝓇𝓍",
    "50 🆅🅞🅡🅣🅔🅡🅧",
    "51 𝓿𝓸𝓻𝓽𝓮",
    ];
  
  if (styleNum >= 1 && styleNum <= fancyTextStyles.length) {
    return fancyTextStyles[styleNum - 1];
  } else {
    return 'Invalid fancy number';
  }
};

module.exports = { vorterxFancy, fancyTextStyles: vorterxFancy(1) };
